src/Enums/ВидыДоходовИностранныхОрганизаций/ВидыДоходовИностранныхОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоходовИностранныхОрганизаций</name>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыКонтролируемаяЗадолженность</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыНоминальныйДержатель</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыУполномоченныйДержатель</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыДепозитарныеПрограммы</name>
  </enumValues>
  <enumValues>
    <name>ИныеДоходыЦБНоминальныйДержатель</name>
  </enumValues>
  <enumValues>
    <name>ИныеДоходыЦБУполномоченныйДержатель</name>
  </enumValues>
  <enumValues>
    <name>ИныеДоходыЦБДепозитарныеПрограмы</name>
  </enumValues>
  <enumValues>
    <name>ДоходыОтРаспределенияПрибыли</name>
  </enumValues>
  <enumValues>
    <name>ДоходыГосЦБ</name>
  </enumValues>
  <enumValues>
    <name>ПроцентныйДоход</name>
  </enumValues>
  <enumValues>
    <name>ДоходыИнтеллектуальнаяСобственность</name>
  </enumValues>
  <enumValues>
    <name>ДоходыОтРеализацииАкцийРФБолее50</name>
  </enumValues>
  <enumValues>
    <name>ДоходыОтРеализацииАкцийРФНеБолее50</name>
  </enumValues>
  <enumValues>
    <name>ДоходыРеализацияЦенныхБумаг</name>
  </enumValues>
  <enumValues>
    <name>ДоходыСрочныеФинИнструменты</name>
  </enumValues>
  <enumValues>
    <name>ДоходыВалютныеОпераций</name>
  </enumValues>
  <enumValues>
    <name>ДоходыРеализацияНедвижимостиРФ</name>
  </enumValues>
  <enumValues>
    <name>ДоходыРеализацияНедвижимостиНеРФ</name>
  </enumValues>
  <enumValues>
    <name>ДоходыРеализацияИмущества</name>
  </enumValues>
  <enumValues>
    <name>ДоходыАрендаИмуществаРФ</name>
  </enumValues>
  <enumValues>
    <name>ДоходыАрендаИмуществаНеРФ</name>
  </enumValues>
  <enumValues>
    <name>ДоходыАрендаТранспортаМеждународныеПеревозки</name>
  </enumValues>
  <enumValues>
    <name>ДоходыМеждународныеПеревозки</name>
  </enumValues>
  <enumValues>
    <name>ДоходыТЭО</name>
  </enumValues>
  <enumValues>
    <name>ПремииСтрахование</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыДепоПремий</name>
  </enumValues>
  <enumValues>
    <name>ШтрафыПени</name>
  </enumValues>
  <enumValues>
    <name>ДоходыПИФБолее50</name>
  </enumValues>
  <enumValues>
    <name>ДоходыПИФНеБолее50</name>
  </enumValues>
  <enumValues>
    <name>ДоходыЦФА</name>
  </enumValues>
  <enumValues>
    <name>ДоходыСервисныеРиски</name>
  </enumValues>
  <enumValues>
    <name>ДоходыТовары</name>
  </enumValues>
  <enumValues>
    <name>ДоходыИноеИмуществоНеОблагаемые</name>
  </enumValues>
  <enumValues>
    <name>ДоходыИмущественныеПраваНеОблагаемые</name>
  </enumValues>
  <enumValues>
    <name>ДоходыУслугиНеОблагаемые</name>
  </enumValues>
  <enumValues>
    <name>ДоходыОблигацииНеОблагаемые</name>
  </enumValues>
  <enumValues>
    <name>ДоходыВПределахВкладаАкционера</name>
  </enumValues>
  <enumValues>
    <name>ИныеДоходыОблагаемые</name>
  </enumValues>
  <enumValues>
    <name>ИныеДоходыНеОблагаемые</name>
  </enumValues>
  <enumValues>
    <name>ДоходыУслугиВзаимозависимым</name>
  </enumValues>
  <enumValues>
    <name>ДоходПриравненныйДивидендам</name>
  </enumValues>
  <enumValues>
    <name>НеУчитываемыеВОтчетности</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыДоходовИностранныхОрганизаций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает ИСТИНА, если вид дохода иностранной организации не облагается налогом в РФ, ЛОЖЬ - в ином случае. 
//
// Параметры:
//   ВидДохода - ПеречислениеСсылка.ВидыДоходовИностранныхОрганизаций.
//
// Возвращаемое значение:
//   Булево - признак облагаемости налогом.
Функция ЭтоНеОблагаемыйНалогомВидДохода(ВидДохода) Экспорт
	
	Результат = (ВидДохода = ДоходыТовары)
	ИЛИ (ВидДохода = ДоходыИноеИмуществоНеОблагаемые)
	ИЛИ (ВидДохода = ДоходыИмущественныеПраваНеОблагаемые)
	ИЛИ (ВидДохода = ДоходыУслугиНеОблагаемые)
	ИЛИ (ВидДохода = ДоходыОблигацииНеОблагаемые)
	ИЛИ (ВидДохода = ДоходыВПределахВкладаАкционера)
	ИЛИ (ВидДохода = ИныеДоходыНеОблагаемые);	
	
	Возврат Результат;

КонецФункции

Функция КодВидаДохода(ВидДохода, ГодОтчета) Экспорт

	КодВидаДохода = Лев(ВидДохода, 2);
	
	Если (КодВидаДохода = "41" ИЛИ КодВидаДохода = "42") И ГодОтчета < 2025 Тогда
		Возврат "39";
	Иначе
		Возврат КодВидаДохода;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
